spec/cassettes/Cbrf_Credit_Organization/_id/if_set_bic.yml

---
http_interactions:
- request:
    method: post
    uri: https://www.cbr.ru/CreditInfoWebServ/CreditOrgInfo.asmx
    body:
      encoding: ASCII-8BIT
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
          <soap12:Body>
            <BicToIntCode xmlns="http://web.cbr.ru/">
              <BicCode>044525225</BicCode>
            </BicToIntCode>
          </soap12:Body>
        </soap12:Envelope>
    headers:
      Content-Type:
      - application/soap+xml; charset=utf-8
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
      Host:
      - www.cbr.ru
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - ddos-guard
      Connection:
      - keep-alive
      Keep-Alive:
      - timeout=60
      Set-Cookie:
      - __ddg10_=1741966486; Domain=.cbr.ru; Path=/; Expires=Fri, 14-Mar-2025 15:54:46
        GMT
      - __ddg1_=jzWE0H6JE3fljKxd8YHA; Domain=.cbr.ru; HttpOnly; Path=/; Expires=Sat,
        14-Mar-2026 15:34:46 GMT
      - __ddg8_=QNYlqOhe2rQDyOT7; Domain=.cbr.ru; Path=/; Expires=Fri, 14-Mar-2025
        15:54:46 GMT
      - __ddg9_=62.213.99.14; Domain=.cbr.ru; Path=/; Expires=Fri, 14-Mar-2025 15:54:46
        GMT
      Content-Type:
      - application/soap+xml; charset=utf-8
      Content-Length:
      - '366'
      Date:
      - Fri, 14 Mar 2025 15:34:46 GMT
      Cache-Control:
      - no-cache
      Pragma:
      - no-cache
      Expires:
      - "-1"
      X-Frame-Options:
      - SAMEORIGIN
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><BicToIntCodeResponse
        xmlns="http://web.cbr.ru/"><BicToIntCodeResult>350000004</BicToIntCodeResult></BicToIntCodeResponse></soap:Body></soap:Envelope>
  recorded_at: Fri, 14 Mar 2025 15:34:46 GMT
recorded_with: VCR 6.3.1
